cduarte0306/RC-Car-peripheral-controller/src/rc-car-peripheral-controller/rc-car-peripheral-controller.cydsn/Generated_Source/PSoC5/speedometer_1_speed_lsb.h
/*******************************************************************************
* File Name: speedometer_1_speed_lsb.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_speedometer_1_speed_lsb_H) /* CY_STATUS_REG_speedometer_1_speed_lsb_H */
#define CY_STATUS_REG_speedometer_1_speed_lsb_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} speedometer_1_speed_lsb_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 speedometer_1_speed_lsb_Read(void) ;
void speedometer_1_speed_lsb_InterruptEnable(void) ;
void speedometer_1_speed_lsb_InterruptDisable(void) ;
void speedometer_1_speed_lsb_WriteMask(uint8 mask) ;
uint8 speedometer_1_speed_lsb_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define speedometer_1_speed_lsb_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define speedometer_1_speed_lsb_INPUTS              8


/***************************************
*             Registers
***************************************/

/* Status Register */
#define speedometer_1_speed_lsb_Status             (* (reg8 *) speedometer_1_speed_lsb_sts_sts_reg__STATUS_REG )
#define speedometer_1_speed_lsb_Status_PTR         (  (reg8 *) speedometer_1_speed_lsb_sts_sts_reg__STATUS_REG )
#define speedometer_1_speed_lsb_Status_Mask        (* (reg8 *) speedometer_1_speed_lsb_sts_sts_reg__MASK_REG )
#define speedometer_1_speed_lsb_Status_Aux_Ctrl    (* (reg8 *) speedometer_1_speed_lsb_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_speedometer_1_speed_lsb_H */


/* [] END OF FILE */
